DataProcessors/КонтрагентРеализацииТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>КонтрагентРеализацииТоваровУслуг</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/КонтрагентРеализацииТоваровУслуг/Ext/ObjectModule.bsl
Перем мКонтрагент, мНаименование, мЮрФизЛицо; // Изменяемые реквизиты контрагента.


// Функция возвращает или устанавливает наименование контрагента связанного с владельцем.
//
Функция Наименование(Владелец, Значение = Неопределено) Экспорт
	
	// Изменение.
	Если (мКонтрагент = Владелец.Контрагент) И (Не Значение = Неопределено) Тогда
		мНаименование = Строка(Значение);
	КонецЕсли;
	
	// Актуализация.
	Если (Не мКонтрагент = Владелец.Контрагент) Тогда
		мКонтрагент = Владелец.Контрагент;
		мНаименование = Владелец.Контрагент.Наименование;
	КонецЕсли;
	
	// Результат.
	Возврат мНаименование;
	
КонецФункции // Наименование()

// Функция возвращает или устанавливает тип контрагента связанного с владельцем.
//
Функция ЮрФизЛицо(Владелец, Значение = Неопределено) Экспорт
	
	// Изменение.
	Если Владелец.Контрагент.Пустая() И (Не Значение = Неопределено) Тогда
		Если (Значение = Перечисления.ЮрФизЛицо.ЮрЛицо) Тогда 
			мЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		Иначе
			мЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		КонецЕсли;
	КонецЕсли;
	
	// Актуализация.
	Если Не Владелец.Контрагент.Пустая() Тогда
		Если (Владелец.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо) Тогда 
			мЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		Иначе
			мЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		КонецЕсли;
	КонецЕсли;
	
	// Результат.
	Возврат мЮрФизЛицо;
	
КонецФункции // ЮрФизЛицо()


// Процедура считывает требуемые реквизиты контрагента связанного с владельцем.
//
Процедура Прочитать(Владелец) Экспорт
	
	// Выборка данных.
	мКонтрагент = Владелец.Контрагент;
	мНаименование = Владелец.Контрагент.Наименование;
	
КонецПроцедуры // Прочитать()

// Процедура записывает требуемые реквизиты контрагента связанного с владельцем и при необходимости
// созадет нового контрагента.
//
Процедура Записать(Владелец, Отказ) Экспорт
	
	// Отказ.
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Запись.
	Попытка
		// -- Проверка необходимости записи.
		Если Владелец.Контрагент.Пустая() Тогда
			Если Не ПустаяСтрока(мНаименование) Тогда
				КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
				КонтрагентОбъект.ЮрФизЛицо = мЮрФизЛицо;
			КонецЕсли;
		Иначе
			Если (Владелец.Контрагент = мКонтрагент) И (Не Владелец.Контрагент.Наименование = мНаименование) Тогда
				КонтрагентОбъект = Владелец.Контрагент.ПолучитьОбъект();
			КонецЕсли;
		КонецЕсли;
		Если (КонтрагентОбъект = Неопределено) Тогда
			Возврат;
		КонецЕсли;
		
		// -- Изменение объекта и запись.
		КонтрагентОбъект.Наименование = мНаименование;
		КонтрагентОбъект.НаименованиеПолное = КонтрагентОбъект.Наименование;
		КонтрагентОбъект.Записать();
		
		// -- Связывание.
		Владелец.Контрагент = КонтрагентОбъект.Ссылка;
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
	КонецПопытки;
	
КонецПроцедуры // Записать()


// Инициализация переменных.
мНаименование = Строка(Неопределено);
мЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
